import { InlineKeyboard } from 'grammy';

export const paymentCommand = async (ctx) => {
  try {
    await ctx.deleteMessage();
  } catch (err) {

  }
  const keyboard = new InlineKeyboard().url('🌐رفتن به سایت ', 'https://manager.faceless.ir/payment_methods');
  const message = `
💳 *نحوه پرداخت در Manager Bot*  

پرداخت‌ها به‌صورت کاملاً آنلاین و امن از طریق وب‌سایت رسمی ما انجام می‌شن 🌐  

✅ *درگاه امن بانکی:*  
تمام تراکنش‌ها از طریق درگاه‌های بانکی تأییدشده و با رمزنگاری SSL انجام می‌شن. یعنی اطلاعات کارتت هیچ‌وقت در سرور ما ذخیره نمی‌شه.  

🧾 *فرآیند پرداخت:*  
۱️⃣ انتخاب پلن مورد نظر در سایت  
۲️⃣ انتقال به درگاه بانکی معتبر  
۳️⃣ بازگشت خودکار به پنل و فعال‌سازی فوری پلن  

🔐 *امنیت تراکنش:*  
از الگوریتم‌های امنیتی روز استفاده می‌کنیم تا مطمئن باشی پولت دقیق و سریع جابه‌جا می‌شه، بدون هیچ واسطه یا ریسکی.  

💬 اگه موقع پرداخت مشکلی پیش اومد، تیم پشتیبانی ما ۲۴ ساعته از طریق سایت پاسخگوئه.

 
`;

  await ctx.reply(message, { reply_markup: keyboard });
};